

#RI是不同阶数的平均随机一致性指标
RI<-c(0,0,0.52,0.89,1.12,1.26,1.36,1.41,1.46,1.49,1.52,1.54,1.56,1.58,1.59)


#用户的法律信用评估
#违章用电次数
#w1,w2,w3分别表示：违章用电次数，恶劣程度，通知整改次数
A31=matrix(c(1,1,1/3,1,1,1/3,3,3,1),ncol=3)
row.names(A31)<-c("w1","w2","w3")
colnames(A31)<-c("w1","w2","w3")
wei31<-AHP(A31,3,RI[3])

#电费缴纳
#w1,w2,w3,w4,w5分别表示：拖欠次数，拖欠天数，拖欠数量，缴纳率,经济贡献率
A32=matrix(c(1,1/3,1,1/3,1/3,3,1,3,1,1,1,1/3,1,1/3,1/3,3,1,3,1,1,3,1,3,1,1),ncol=5)
row.names(A32)<-c("w1","w2","w3","w4","w5")
colnames(A32)<-c("w1","w2","w3","w4","w5")
wei32<-AHP(A32,5,RI[5])

#w1,w2分别表示： 违章用电次数，电费缴纳
A3=matrix(c(1,1/5,1,5),ncol=2)
row.names(A3)<-c("w1","w2")
colnames(A3)<-c("w1","w2")
#wei3<-AHP(A3,2,RI[2]),可以尝试调整
wei3<-c(0.6,0.4)

#用户电气设备评估权重
#配电间基本情况
#w1,w2,w3分别表示：四防一通，室内整洁程度，电工配置情况
A41=matrix(c(1,1/5,1/3,5,1,3,3,1/3,1),ncol=3)
row.names(A41)<-c("w1","w2","w3")
colnames(A41)<-c("w1","w2","w3")
wei41<-AHP(A41,3,RI[3])

#电气设备基本情况
#w1~w6分别表示配电柜配置情况，进线电源配置情况，无功补偿情况，
#有无连锁及五防，电气设备接地情况；有无漏油情况
A42=matrix(c(1,1,1/3,3,3,3,1,1,1/3,3,3,3,3,3,1,5,5,5,1/3,1/3,1/5,1,1,1,1/3,1/3,1/5,1,1,1,1/3,1/3,1/5,1,1,1),ncol=6)
row.names(A42)<-c("w1","w2","w3","w4","w5","w6")
colnames(A42)<-c("w1","w2","w3","w4","w5","w6")
wei42<-AHP(A42,6,RI[6])

#安全用具及规程
#w1,w2,w3分别表示：安全用具配备，安全工作规程，典型操作票
A43=matrix(c(1,3,3,1/3,1,1,1/3,1,1),ncol=3)
row.names(A43)<-c("w1","w2","w3")
colnames(A43)<-c("w1","w2","w3")
wei43<-AHP(A43,3,RI[3])

#电气设备维护情况
#w1,w2,w3分别表示：定期试验情况，变压器大修周期，定期巡视情况
A44=matrix(c(1,1/3,1,3,1,3,1,1/3,1),ncol=3)
row.names(A44)<-c("w1","w2","w3")
colnames(A44)<-c("w1","w2","w3")
wei44<-AHP(A44,3,RI[3])

#w1,w2,w3,w4分别表示：配电情况，电气设备配置情况，安全用具及规程，电气设备维护情况
A4=matrix(c(1,1/3,1,3,3,1,3,3,1,1/3,1,3,1/3,1/3,1/3,1),ncol=4)
row.names(A4)<-c("w1","w2","w3","w4")
colnames(A4)<-c("w1","w2","w3","w4")
wei4<-AHP(A4,4,RI[4])

#安全评价评估权重
#按经验初始化一套权重

#设备管理
wei51=0.29
#wei511,wei512,wei513分别表示：继电保护，一次设备，二次设备
wei511=0.07
wei512=0.12
wei513=0.1

#运行管理
wei52=0.28
#wei521表示用电事故管理
wei521=0.11
#wei5211,wei5212,wei5213分别表示年事故次数，事故等级，事故类型
wei5211=0.04
wei5212=0.04
wei5213=0.03
#wei522表示谐波记录管理
wei522=0.07
#wei523表示自备电源管理
wei523=0.1

#组织管理
wei53=0.27
#wei531表示电工管理制度
wei531=0.12
#wei5311,wei5312,wei5313,wei5314表示巡回检查制度，交接班制度，值班制度，运行维护制度
wei5311=0.03
wei5312=0.03
wei5313=0.03
wei5314=0.03
#wei532表示电气组织管理
wei532=0.15
#wei5321,wei5322,wei5323表示:工作票制度，操作票制度，倒闸操作制度
wei5321=0.05
wei5322=0.05
wei5323=0.05
#安全评价历史档案
wei54=0.16
#wei541,wei542表示:年缺陷条数及等级，整改率
wei541=0.07
wei542=0.09

#如果想要用AHP或者专家建议，请自行调用AHP或expr函数

#合作信用评估指标权重
#w1,w2,w3分别表示表示调度合作记录，需求侧管理，电费退补合作记录
A6=matrix(c(1,1,1/3,1,1,1/3,3,3,1),ncol=3)
row.names(A6)<-c("w1","w2","w3")
colnames(A6)<-c("w1","w2","w3")
wei6<-AHP(A6,3,RI[3])    

#总体评估，w1~w6分别表示经营能力，无功补偿，法律信用，用电基本情况，安全评价，合作信用
A=matrix(c(1,3,5,5,3,3,1/3,1,5,3,3,1,1/5,1/5,1,1/3,1/5,1/7,1/3,1/3,3,1,1,1/3,1/3,1/3,5,1,1,1/3,1/3,1,7,3,3,1),ncol=6)
row.names(A)<-c("w1","w2","w3","w4","w5","w6")
colnames(A)<-c("w1","w2","w3","w4","w5","w6")
wei<-AHP(A,6,RI[6])


